IdeaRS.OpenModel.ReferenceElement
Reference element class

IdeaRS.OpenModel.ReferenceElement.#ctor
Constructor

IdeaRS.OpenModel.ReferenceElement.#ctor(IdeaRS.OpenModel.OpenElementId)
Constructor
element: Referenced element

IdeaRS.OpenModel.ReferenceElement.TypeName
Element type name

IdeaRS.OpenModel.ReferenceElement.Id
Element Id

IdeaRS.OpenModel.ReferenceElement.Element
Referenced element